
%% 初始状态
plant.init.lat_lon_alt   = [30. 120. 440];
plant.init.vx_vy_vz      = [0 0 0];
plant.init.ax_ay_az      = [0 0 0];
plant.init.phi_theta_psi = [0,0,0];
plant.init.p_q_r         = [0 0 0];

%% 发动机
% 发动机安装位置
plant.engine.position  = [0,0,0];
% 发动机推力方向
plant.engine.direction = [1,0,0];
% 发动机旋转方向
plant.engine.rotation  = +1;
% 发动机拉力曲线
eng_perf1 = [
    %转速rpm	节气门开度	推力（N）
    3400	12/100	55
    4000	17/100	69.1
    4270	19/100	76
    4550	21/100	82.2
    4800	25/100	89.5
    5070	31/100	99.3
    5250	32/100	105.8
    5450	33/100	112.3
    5700	34/100	123.5
    6000	41/100	139
    6250	45/100	152.5
    6530	67/100	163.9
    7000	72/100	170
    7250	80/100	174.2
    ];
plant.engine.thrust.delta = eng_perf(:,2);
plant.engine.thrust.force = eng_perf(:,3);
% 发动机扭矩曲线
eng_perf2 = [
    % 节气门开度%	功率（kW）	扭矩(N*m)	转速(rpm)	燃油消耗率kg/（kW·h）
    20/100	0.69	1.57	4200	525
    30/100	1.92	3.31	5550	392
    40/100	2.45	3.65	6400	382
    50/100	3.23	4.47	6900	350
    60/100	3.63	4.85	7150	386
    70/100	3.74	4.92	7250	369
    80/100	3.78	4.92	7330	372
    90/100	3.84	4.92	7350	378
    100/100	3.84	4.99	7350	383
    ];
plant.engine.torque.delta  = eng_pef2(:,1);
plant.engine.torque.moment = eng_pef2(:,3);

%% 旋翼动力
R = 1;
A = (45:90:360)';

% 电机安装位置
plant.motor.position = [R*cosd(A), R*sind(A), 0*A];
% 电机拉力轴向
plant.motor.direction = [
    0 0 -1
    0 0 -1
    0 0 -1
    0 0 -1
    ];
% 电机旋转方向，拉力轴向右手定则（俯视，逆时针为正，顺时针为负）
plant.motor.rotation = [
    +1
    -1
    -1
    +1
    ];
mc_perf = [
    % 油门	电调温度	拉力（kg）	转速(rpm)	电压（V）	供电电流（A）	扭矩（N·M）
    20/100	27	1.99	1296.8	58.2	2.35	0.8
    25/100	27	3.15	1622.8	58.25	4.33	1.23
    30/100	27	4.51	1948.8	58.14	6.93	1.74
    35/100	27	6.09	2265.5	58.02	10.51	2.35
    40/100	27	7.96	2569.4	57.87	15.15	3.06
    45/100	28	9.76	2855.9	57.70	20.6	3.75
    50/100	28	11.65	3116.9	57.56	27.0	4.49
    55/100	28	13.82	3361.7	57.30	34.9	5.31
    60/100	28	15.81	3591.4	57.11	44.4	6.23
    65/100	29	18.13	3815.2	56.74	53.6	7.04
    70/100	29	19.91	3999.7	56.61	63.9	7.79
    75/100	30	22.13	4192.2	56.11	76.2	8.7
    80/100	30	23.54	4392.9	55.83	86.6	9.39
    85/100	31	25.65	4518.2	55.47	99.9	10.12
    90/100	32	26.96	4580.8	55.18	111.2	10.63
    95/100	33	28.27	4665.5	54.81	123.4	11.03
    100/100	33	27.74	4645.8	54.86	121.1	10.83
    ];
% 拉力曲线
plant.motor.thrust.delta = mc_perf(:,1);
plant.motor.thrust.force = mc_perf(:,3);
% 扭矩曲线
plant.motor.torque.delta  = mc_perf(:,1);
plant.motor.torque.moment = mc_perf(:,7);

%% 舵机
